Revit 2024 API
ParameterTypeId.MepSpotCenterlineElevation Property
 "Spot Centerline Elevation": used for both design and fabrication components
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId MepSpotCenterlineElevation { get; }
Visual Basic
Public Shared ReadOnly Property MepSpotCenterlineElevation As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ MepSpotCenterlineElevation {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace